---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizeSuffix
source: html/abf0c448-17e8-dd63-bc37-8e695d268b75.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizeSuffix Property

The round duct size suffix string.

## Syntax (C#)
```csharp
public string RoundDuctSizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null